import FetchService from "./fetch-service";

export default class FakeGpApiService extends FetchService {

    replyWithDelay = (data, delay = 700) => {
        return new Promise((resolve) => {
            setTimeout(() => {
                resolve(data)
            }, delay);
        })
    }

    getTypesOfJobs = () => {
        return this.replyWithDelay([
            {"id": 1, "section": "Раздел Земляные работы", "types": [
                {"id": 1, "name": "Разработка котлована", "measureUnit": "м3"},
                {"id": 2, "name": "Рытье траншеи", "measureUnit": "м3"},
                {"id": 3, "name": "Обратная засыпка", "measureUnit": "м3"},
                {"id": 4, "name": "Обвалование", "measureUnit": "м3"}
            ]},
            {"id": 2, "section": "Раздел Свайные работы", "types": [
                {"id": 5, "name": "Погружение свай", "measureUnit": "шт"},
                {"id": 6, "name": "Устройство буронабивных свай", "measureUnit": "шт"}
            ]},
            {"id": 3, "section": "Раздел Конструкции металлические", "types": [
                {"id": 7, "name": "Монтаж оголовников свай", "measureUnit": "шт"},
                {"id": 8, "name": "Монтаж префабрикованных КМ (укрупненные конструкции, например, фермы)", "measureUnit": "тн"},
                {"id": 9, "name": "Монтаж сборных резервуаров", "measureUnit": "тн"}
            ]}
        ]);
    }

    getStructuralElements = () => {
        return this.replyWithDelay([
            {"id": 1, "elemId": "123", "name": "Труба стальная D57", "class": "Трубы", "properties": [
                {"name": "Диаметр", "measureUnit": "", "value": "57"},
                {"name": "Материал", "value": "Сталь"},
                {"name": "Длина", "measureUnit": "м", "value": "11"},
                {"name": "Уровень", "measureUnit": "мм", "value": "2061"}
            ]},
            {"id": 2, "elemId": "234", "name": "Труба стальная D57", "class": "Трубы", "properties": [
                {"name": "Диаметр", "measureUnit": "", "value": "57"},
                {"name": "Материал", "value": "Сталь"},
                {"name": "Длина", "measureUnit": "м", "value": "12"},
                {"name": "Уровень", "measureUnit": "мм", "value": "2062"}
            ]},
            {"id": 3, "elemId": "555", "name": "Швеллер_с_уклоном_внутренних_граней_полок_(У)_ГОСТ_8240-97.МД.2001320.УР.v03", 
                "class": "Швеллера", "properties": [
                {"name": "Диаметр", "measureUnit": "", "value": "53"},
                {"name": "Материал", "value": "Сталь"},
                {"name": "Длина", "measureUnit": "м", "value": "13"},
                {"name": "Уровень", "measureUnit": "мм", "value": "2063"}
            ]}
        ]);
    }

    getMeasureUnits = () => {
        return this.replyWithDelay([
            {"id": 1, "unit": "100 м3", "base": "м3", "factor": 0.01},
            {"id": 2, "unit": "штук", "base": "шт", "factor": 1}
        ]);
    }

    getDesignBrands = () => {
        return this.replyWithDelay([
            {"id": 1, "name": "Технология производства", "brand": "ТХ"},
            {"id": 2, "name": "Технологические коммуникации", "brand": "ТК"},
            {"id": 3, "name": "Генеральный план и сооружения транспорта", "brand": "ГТ"},
            {"id": 4, "name": "Генеральный план", "brand": "ГП"},
            {"id": 5, "name": "Архитектурные решения", "brand": "АР"},
            {"id": 6, "name": "Интерьеры", "brand": "АИ"},
            {"id": 7, "name": "Конструкции железобетонные", "brand": "КЖ"},
            {"id": 8, "name": "Конструкции деревянные", "brand": "КД"},
            {"id": 9, "name": "Архитектурно-строительные решения", "brand": "АС"},
            {"id": 10, "name": "Конструкции металлические деталировочные", "brand": "КМД"},
            {"id": 11, "name": "Водопровод и канализация", "brand": "ВК"},
            {"id": 12, "name": "Отопление, вентиляция и кондиционирование", "brand": "ОВ"},
            {"id": 13, "name": "Тепломеханические решения котельных", "brand": "ТМ"},
            {"id": 14, "name": "Воздухоснабжение", "brand": "ВС"},
            {"id": 15, "name": "Пылеудаление", "brand": "ПУ"},
            {"id": 16, "name": "Холодоснабжение", "brand": "ХС"},
            {"id": 17, "name": "Газоснабжение (внутренние устройства)", "brand": "ГСВ"},
            {"id": 18, "name": "Силовое электрооборудование", "brand": "ЭМ"},
            {"id": 19, "name": "Электрическое освещение (внутреннее)", "brand": "ЭО"},
            {"id": 20, "name": "Системы связи", "brand": "СС"},
            {"id": 21, "name": "Пожаротушение", "brand": "РТ"},
            {"id": 22, "name": "Радиосвязь, радиовещание и телевидение", "brand": "ПТ"},
            {"id": 23, "name": "Пожарная сигнализация", "brand": "ПС"},
            {"id": 24, "name": "Охранная и охранно-пожарная сигнализация", "brand": "ОС"},
            {"id": 25, "name": "Гидротехнические решения", "brand": "ГР"},
            {"id": 26, "name": "Автоматизация …", "brand": "А …"},
            {"id": 27, "name": "Автоматизация комплексная", "brand": "АК"},
            {"id": 28, "name": "Антикоррозионная защита конструкций зданий, сооружений", "brand": "АЗ"},
            {"id": 29, "name": "Антикоррозионная защита технологических аппаратов, газоходов и трубопроводов", "brand": "АЗО"},
            {"id": 30, "name": "Тепловая изоляция оборудования и трубопроводов", "brand": "ТИ"},
            {"id": 31, "name": "Автомобильные дороги", "brand": "АД"},
            {"id": 32, "name": "Железнодорожные пути", "brand": "ПЖ"},
            {"id": 33, "name": "Сооружения транспорта", "brand": "ТР"},
            {"id": 34, "name": "Наружные сети водоснабжения", "brand": "НВ"},
            {"id": 35, "name": "Наружные сети канализации", "brand": "НК"},
            {"id": 36, "name": "Наружные сети водоснабжения и канализации", "brand": "НВК"},
            {"id": 37, "name": "Тепломеханические решения тепловых сетей", "brand": "ТС"},
            {"id": 38, "name": "Наружные газопроводы", "brand": "ГСН"},
            {"id": 39, "name": "Наружное электроосвещение", "brand": "ЭН"},
            {"id": 40, "name": "Электроснабжение", "brand": "ЭС"}
        ]);
    }
}